from parstdex import Parstdex, settings
import pprint
from parstdex.utils.datatime_extractor import extract_duration

duration_tests_middle = [
    "از امروز تا فردا",
    "از پنجشنبه تا جمعه درس خواندم",
    "از چهار سال پیش تا به حال سمت آن نرفتم",
    "از پریشب تا دیشب تمام مدت خواب به چشمانم نیامده",
    "از پنجشنبه تا جمعه پاره شدم تا هر روز راحت باشم",
    "از سه‌شنبه قبل لغایت ۳ فروردین ",
    "از ۲۰ روز پیش تا کنون در گیر آن بودیم",
    # "از 1444/12/3 هجری قمری تا 1445/3/2 هجری شمسی",
    
    "تا دو روز دیگر خوشحالم",
    "از امروز تا پایان هفته آتی وقت مهلت ارسال درخواست ها میباشد",
]

duration_tests_start = [
    "طی فروردین",
    "طی ژانویه",
    "در طول یکشنبه",
    "ظرف محرم",
    "طی دو ماه",
    "طی چهارشنبه",
    "در عرض ۱ ثانیه ازین رو به آن رو شد",
    "ظرف دو روز تمرین را انجام میدهم",
    "در مدت ۹ ماه زایمان کردم",
    # "طی این ماه",
    "در فاصله دو هفته قرار است به سرانجام برسیم",
    "در طول ۱ سال پروژه را انجام دادم",
    "در بازه ۱ ماهه درس میخوانم",
    # "بین اسفند و فروردین سال ۵۷ جنگ بود",
]



tests = [
    "از سال بعد هر روز درس می‌خوانم",
    "هر سه‌شنبه",
    "دو شنبه ها راس ساعت ۵ عصر",
    "دوشنبه شب تولد حاج آقا است",
    "در محل همایش های بین المللی مورخ هفدهم فروردین  سال هزار و پانصد ونود و سه",
    "تمام پنج شنبه های سال",
    " در تاریخ ۱۳۹۸/۰۳/۱۴ ایران موفق به بازگشایی شدیم",
    "دیروز به حمام رفتم",
    "همین چهارشنبه",
    "سه‌شنبه سه هفته قبل",
    "این اتفاق سه روز بعد از اولین چهارشنبه‌ی سال رخ داد",
    "در ۲۲ بهمن چهار سال پیش انقلاب شد",
    "ماه آینده",
    "۳۰ روز گذشته",
    "هزاره سوم",
    "دو قرن سکوت ایرانیان",
    "بعد از تصادف دیگر هر یکشنبه به کلیسا میروم",
    "سال ها درس خواندم",
]



model = Parstdex(debug_mode=False)


def run():
    result = {}
    for sentence in duration_tests_middle:
        # spans = model.extract_span(sentence)
        # result['spans'] = spans

        print(sentence)

        markers = model.extract_marker(sentence)
        result['markers'] = markers

        values = model.extract_value(sentence)
        print(extract_duration(markers=markers))
        result['values'] = values

        # ners = model.extract_ner(sentence)
        # result['ner'] = ners

        pprint.pprint(result,)
        print("==" * 50)


run()
