from parstdex import Parstdex, marker_extractor, settings
import pprint
from parstdex.utils.datatime_extractor import extract_duration, extract_exact
from extract_cron import StatementType, decide_type, extract_cron

duration_tests_middle = [
    "از امروز تا فردا",
    "از پنجشنبه تا جمعه درس خواندم",
    "از چهار سال پیش تا به حال سمت آن نرفتم",
    "از پریشب تا دیشب تمام مدت خواب به چشمانم نیامده",
    "از پنجشنبه تا جمعه پاره شدم تا هر روز راحت باشم",
    "از سه‌شنبه قبل لغایت ۳ فروردین ",
    "از ۲۰ روز پیش تا کنون در گیر آن بودیم",
    # "از 1444/12/3 هجری قمری تا 1445/3/2 هجری شمسی",
    "تا دو روز دیگر خوشحالم",
    "از امروز تا پایان هفته آتی وقت مهلت ارسال درخواست ها میباشد",
    "از هفته پیش تا حالا دارم‌میمیرم",
]

duration_tests_start = [
    "طی فروردین",
    "طی ژانویه",
    "در طول یکشنبه",
    "ظرف محرم",
    "طی دو ماه",
    "طی چهارشنبه",
    "در عرض ۱ ثانیه ازین رو به آن رو شد",
    "ظرف دو روز تمرین را انجام میدهم",
    "در مدت ۹ ماه زایمان کردم",
    # "طی این ماه",
    "طی سال گذشته",
    "در فاصله دو هفته قرار است به سرانجام برسیم",
    "در طول ۱ سال پروژه را انجام دادم",
    "در بازه ۱ ماهه درس میخوانم",
    # "بین اسفند و فروردین سال ۵۷ جنگ بود",
]

exact_tests = [
    "دوشنبه شب تولد حاج آقا است",
    "در محل همایش های بین المللی مورخ هفدهم فروردین  سال هزار و پانصد و نود و سه",
    " در تاریخ ۱۳۹۸/۰۳/۱۴ ایران موفق به بازگشایی شدیم",
    "همین چهارشنبه",
    "سه‌شنبه سه هفته قبل",
    "این اتفاق سه روز بعد از اولین چهارشنبه‌ی سال رخ داد",
    "در ۲۲ بهمن چهار سال پیش انقلاب شد",
    "ماه آینده",
    "۳۰ روز گذشته",
    "هزاره سوم",
]


tests = [
    "از سال بعد هر روز درس می‌خوانم",
    "هر سه‌شنبه",
    "دو شنبه ها راس ساعت ۵ عصر",
    "تمام پنج شنبه های سال",
    "دیروز به حمام رفتم",
    "دو قرن سکوت ایرانیان",
    "بعد از تصادف دیگر هر یکشنبه به کلیسا میروم",
    "سال ها درس خواندم",
]


crons = [
    # "هر دقیقه",                             # "* * * * *"
    # "هر هفده دقیقه",                        # "*/17 * * * *"
    # "هر ساعت",
    # "هر نوزده ساعت", 
    # # "هر عصر ۶:۱۷",                          # "17 6 * * * *"
    # "هر دوشنبه",                            # "0 0 * * 1"
    # "هر یکشنبه",                            # "0 0 * * 7"
    # "هر دوشنبه تا سه‌شنبه",                  # "0 0 * * 1-2"
    # "هر دو روز",                             # "0 0 * * */2"
    # "هر روز",                               # "0 0 * * *"
    # "هر روز ساعت 5 و 31 دقیقه",                               # "0 0 * * *"
    # "هر ماه",
    # "هر دو ماه",
    "هر سپتامبر",
    "هر اوکتبر تا دسامبر",
    "هر ژانویه سه‌شنبه تا پنجشنبه ها ساعت سیزده",
    "هر ژانویه سه‌شنبه تا پنجشنبه ها",
    "دوشنبه‌ها",
    "سه‌شنبه‌ها",




    # "چهار‌شنبه‌های هر ماه",                   # "0 0 * * 3"
    # "هر یکشنبه‌های فروردین ماه",             # "0 0 * "
    # "هشتم تا پانزدهم هر ماه",               # "0 0 0 * * "
    # "هر دوشنبه تا سه‌شنبه",                  # "0 0 * * 1-2"
    # "هر روز هفته",                          # "0 0 * * *"
    # "هر بیست و سوم ماه"                     # "0 0 23 * *"
    # "پنجشنبه‌ها ساعت ده و سی‌ و یک دقیقه",    # "31 10 * * 4"
    # "هشتم تا پانزدهم هر ماه",               # "0 0 0 * * "
]


model = Parstdex(debug_mode=False)


def run():
    result = {}
    tests = crons
    for sentence in tests:
        # spans = model.extract_span(sentence)
        # result['spans'] = spans

        # print(sentence)

        markers = model.extract_marker(sentence)
        result['markers'] = markers

        values = model.extract_value(sentence)

        if decide_type(markers) == StatementType.CRON:
            print(extract_cron(sentence))
            pass
        else:
            # print(extract_duration(markers=markers))
            pass

        result['values'] = values

        # ners = model.extract_ner(sentence)
        # result['ner'] = ners

        # pprint.pprint(result,)
        # print("==" * 50)




run()
