from parstdex import Parstdex, marker_extractor, settings
import pprint
from parstdex.utils.datatime_extractor import extract_exact_or_duration
from extract_cron import extract_cron

duration_tests_middle = [
    "از امروز تا فردا",
    "از پنجشنبه تا جمعه درس خواندم",
    "از چهار سال پیش تا به حال سمت آن نرفتم",
    "از پریشب تا دیشب تمام مدت خواب به چشمانم نیامده",
    "از پنجشنبه تا جمعه پاره شدم تا هر روز راحت باشم",
    "از سه‌شنبه قبل لغایت ۳ فروردین ",
    "از ۲۰ روز پیش تا کنون در گیر آن بودیم",
    # "از 1444/12/3 هجری قمری تا 1445/3/2 هجری شمسی",
    "تا دو روز دیگر خوشحالم",
    "از امروز تا پایان هفته آتی وقت مهلت ارسال درخواست ها میباشد",
    "از هفته پیش تا حالا دارم‌میمیرم",
]

duration_tests_start = [
    "طی فروردین",
    "طی ژانویه",
    "در طول یکشنبه",
    "ظرف محرم",
    "طی دو ماه",
    "طی چهارشنبه",
    "در عرض ۱ ثانیه ازین رو به آن رو شد",
    "ظرف دو روز تمرین را انجام میدهم",
    "در مدت ۹ ماه زایمان کردم",
    # "طی این ماه",
    "طی سال گذشته",
    "در فاصله دو هفته قرار است به سرانجام برسیم",
    "در طول ۱ سال پروژه را انجام دادم",
    "در بازه ۱ ماهه درس میخوانم",
    # "بین اسفند و فروردین سال ۵۷ جنگ بود",
]

exact_tests = [
    "دوشنبه شب تولد حاج آقا است",
    "در محل همایش های بین المللی مورخ هفدهم فروردین  سال هزار و پانصد و نود و سه",
    " در تاریخ ۱۳۹۸/۰۳/۱۴ ایران موفق به بازگشایی شدیم",
    "همین چهارشنبه",
    "سه‌شنبه سه هفته قبل",
    "این اتفاق سه روز بعد از اولین چهارشنبه‌ی سال رخ داد",
    "در ۲۲ بهمن چهار سال پیش انقلاب شد",
    "ماه آینده",
    "۳۰ روز گذشته",
    "هزاره سوم",
]


tests = [
    "از سال بعد هر روز درس می‌خوانم",
    "هر سه‌شنبه",
    "دو شنبه ها ساعت ۵ عصر",
    "تمام پنج شنبه های سال",
    "دیروز به حمام رفتم",
    "دو قرن سکوت ایرانیان",
    "بعد از تصادف دیگر هر یکشنبه به کلیسا میروم",
    "سال ها درس خواندم",
]


crons = [
    ("هر دقیقه",                                                "* * * * *"),
    ("هر هفده دقیقه",                                           "*/17 * * * *"),
    ("هر ساعت",                                                 "0 * * * *"),
    ("هر نوزده ساعت",                                           "0 */19 * * *"),
    ("هر دوشنبه",                                               "0 0 * * 1"),
    ("هر یکشنبه",                                               "0 0 * * 7"),
    ("هر دوشنبه تا سه‌شنبه",                                     "0 0 * * 1-2"),
    ("هر دو روز",                                               "0 0 */2 * *"),
    ("هر روز",                                                  "0 0 * * *"),
    ("هر روز ساعت 5",                                           "0 5 * * *"),
    ("هر ماه",                                                  "0 0 1 * *"),
    ("هر دو ماه",                                               "0 0 1 */2 *"),
    ("هر سپتامبر",                                              "0 0 1 9 *"),
    ("هر اوکتبر تا دسامبر",                                     "0 0 1 10-12 *"),
    ("هر ژانویه سه‌شنبه تا پنجشنبه ها ساعت سیزده",               "0 13 1 1 2-4"),
    ("هر ژانویه سه‌شنبه تا پنجشنبه ها",                          "0 0 1 1 2-4"),
    ("دوشنبه‌ها",                                                "0 0 * * 1"),
    ("سه‌شنبه‌ها",                                                "0 0 * * 2"),


    # "چهار‌شنبه‌های هر ماه",                   # "0 0 * * 3"
    # "هر یکشنبه‌های فروردین ماه",             # "0 0 * "
    # "هشتم تا پانزدهم هر ماه",               # "0 0 0 * * "
    # "هر دوشنبه تا سه‌شنبه",                  # "0 0 * * 1-2"
    # "هر روز هفته",                          # "0 0 * * *"
    # "هر بیست و سوم ماه"                     # "0 0 23 * *"
    # "پنجشنبه‌ها ساعت ده و سی‌ و یک دقیقه",    # "31 10 * * 4"
    # "هشتم تا پانزدهم هر ماه",               # "0 0 0 * * "
]


model = Parstdex(debug_mode=False)


def extract_exact_or_duration_or_cron(sentence):
    markers = model.extract_marker(sentence)
    values = model.extract_value(sentence)
    values = extract_exact_or_duration(markers=markers)
    cron = extract_cron(sentence)
    if cron is not None:
        values.append(cron)
    return values

def run():
    result = {}
    for sentence in tests:
        print(sentence)
        values = extract_exact_or_duration_or_cron(sentence)
        print(values)


def test_crons():
    for sentence, cron in crons:
        print(sentence, "\n", cron)
        extraced_cron = extract_cron(sentence)['value']
        print(extraced_cron)
        assert extraced_cron == cron

# test_crons()

run()
